pascal-3.2/tutorialsOld/surfaceTracking/interTrackMHDmagFoam/slanting2D/system/region_fluid/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

matchTolerance           1e-6;

pointSync                true;

patchInfo
(
    {
        name             trackedSurface;
        constructFrom    set;
        set              faceSet_trackedSurface;

        dictionary
        {
            type         patch;
        }
    }

    {
        name             movingWall;
        constructFrom    set;
        set              faceSet_movingWall;

        dictionary
        {
            type         wall;
        }
    }

    {
        name             fixedWall;
        constructFrom    set;
        set              faceSet_fixedWall;

        dictionary
        {
            type         wall;
        }
    }
);

// ************************************************************************* //
